import React from "react";
import {InfoLeft, } from "./InfoLeft";
import {InfoRight } from "./InfoRight";
const sections = [
  {
    title: "القضايا المدنية",
    text: "كافة المنازعات الخاصة بالملكية والايجار والتأمين والرهن والوكالة والهبة والجمعيات الاهلية والاندية الرياضية وقضايا التعويض وغيرها من القضايا المدنية.",
    img: "https://plus.unsplash.com/premium_photo-1661329930662-19a43503782f?q=80&w=2670&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
  },
  {
    title: "القضايا التجارية",
    text: "يتميز المكتب فى هذا النوع من القضايا، مثل عقود البيع التجارى والايجار والرهن والوكالة والتأمين بمختلف انواعها، والوكالات التجارية، وقضايا الشيكات والكمبيالات والسندات لأمر، وعقود توريد البضائع والخدمات، والصناعة واعمال الصرافة، ومجالات النشر، والطباعة، والاتصالات، والإعلان، الاستغلال التجارى لبرامج الحاسب الآلى والبث الفضائى عبر الأقمار الصناعية، العمليات الاستخراجية لمواد الثروات الطبيعية من المناجم والمحاجر ومنابع النفط والغاز وغيرها، ومقاولات تشييد العقارات أو شراؤها أو استئجارها بقصد بيعها أو تأجيرها. واعمال مكاتب السياحة ومكاتب التصدير والاستيراد والإفراج الجمركى ومكاتب الاستخدام ومحال البيع بالمزاد العلنى. واعمال الفنادق والمطاعم، وقضايا المنافسة التجارية.",
    img: "https://plus.unsplash.com/premium_photo-1661540409860-fe00bb21a51c?q=80&w=2664&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
  },
  {
    title: "تأسيس الشركات التجارية",
    text: "لدى مكتبنا خبرة استثنائية وفريق متخصص في مجال تأسيس الشركات، وتشمل تحديدا: تأسيس الشركات وقيدها واشهارها واستخراج كافة التراخيص الضرورية، تسجيل العلامات التجارية، والأسماء التجارية، وبراءات الاختراع واسماء النطاق، اعداد لوائح حوكمة الشركات، وضبط الانظمة الداخلية للشركة طبقا لها، إدارة عمليات الاستحواذ ودمج الشركات، التمثيل القانوني للشركات (من خلال حضور الاجتماعات، وتوقيع العقود، والاتفاقيات)، إبداء الرأي القانوني فى كافة المسائل التى تحتاج الى استفسار، ادارة قضايا الشركات امام المحاكم وهيئات التحكيم، تأسيس كيانات الاستثمار الأجنبي من خلال استصدار التراخيص اللازمة ومراجعة وإعداد عقودها القانونية اللازمة لممارسة تلك الشركات لنشاطها.",
    img: "https://plus.unsplash.com/premium_photo-1694476885791-7be2c6c37f37?q=80&w=2670&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
  },
  {
    title: "قضايا الافلاس",
    text: "رفع وادارة قضايا الافلاس والصلح الواقى منه واجراءات اعادة الهيكلة وتصفية الشركات.",
    img: "https://plus.unsplash.com/premium_photo-1661394715096-46bb7027fc27?q=80&w=2670&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
  },
  {
    title: "عمليات البنوك",
    text: "تقديم كافة الاستشارات القانونية فى مجال عمليات البنوك، وتصميم العقود المصرفية وادارة التعاقدات المرتبطة بها، والقضايا والمنازعات امام المحاكم وهيئات التحكيم.",
    img: "https://media.istockphoto.com/id/1456104141/photo/lawyer-who-provides-legal-advice-in-the-office-businessman-and-lawyer-shaking-hands.jpg?s=1024x1024&w=is&k=20&c=z2LkGvVlrSSF4k4MlYi7Fr1pnM4oAKUWCBXES4uQZfQ=",
  },
  {
    title: "البنية التحتية والعقارات والطاقة",
    text: "يقدم مكتبنا خدمات قانونية مميزة فى مجال مشروعات البنية التحتية والطاقة تتسم بالشمولية والفعالية رغم ما تتسم به هذه الخدمات من تطور وتعقيد.",
    img: "https://images.unsplash.com/photo-1479142506502-19b3a3b7ff33?q=80&w=2670&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
  },
  {
    title: "قضايا أسواق رأس المال",
    text: "يمتلك مكتبنا خبرة فى منازعات اسواق رأس المال، وعمليات الدمج والاستحواذ، والاكتتاب العام، والصفقات الخاصة، وتقديم الاستشارات القانونية فى مجال اكتتاب الاسهم وتداولها، وصناديق الاستثمار والمحافظ المالية وغيرها.",
    img: "https://plus.unsplash.com/premium_photo-1661497281000-b5ecb39a2114?q=80&w=2670&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
  },
  {
    title: "المراجعات القانونية",
    text: "يقدم مكتبنا خدمات مميزة فى مجال مراجعة وتدقيق كافة اللوائح القانونية، والعقود، والسياسات، والأنظمة الداخلية، والتعليق عليها وتقديم المقترحات بشأنها.",
    img: "https://cdn.al-ain.com/lg/images/2018/9/19/85-003206-egypt-human-rights-brotherhood-judiciary-judgments_700x400.jpeg",
  },
  {
    title: "منازعات القضاء الاداري",
    text: "يختص المكتب بقضايا القضاء الادارى والمحاكم التأديبية امام محاكم مجلس الدولة ولجان فض المنازعات.",
    img: "https://cdn.pixabay.com/photo/2017/02/12/14/00/justice-2060093_1280.jpg",
  },
  {
    title: "التحكيم والوسائل البديلة لفض المنازعات",
    text: "يقدم مكتبنا خدمة فى غاية التميز فى مجالات التحكيم والتوفيق والوساطة امام هيئات ومراكز التحكيم المحلية والدولية باللغات العربية والانجليزية.",
    img: "https://cdn.pixabay.com/photo/2023/12/10/19/08/judgment-8442199_960_720.png",
  },
  {
    title: "أعمال الملاحة البحرية والجوية",
    text: "يقدم المكتب خدمات قانونية مميزة فى كافة ما يتعلق باعمال الملاحة البحرية والجوية، اهمها: شراء أو بيع أو تأجير أو استئجار السفن أو الطائرات، النقل البحرى والنقل الجوى، وعمليات الشحن أو التفريغ، استخدام الملاحين أو الطيارين أو غيرهم من العاملين فى السفن أو الطائرات.",
    img: "https://cdn.alweb.com/thumbs/mo3amalty/article/fit710x532/%D9%83%D9%8A%D9%81%D9%8A%D8%A9-%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B9%D9%84%D8%A7%D9%85-%D8%B9%D9%86-%D8%A7%D9%84%D9%82%D8%B6%D8%A7%D9%8A%D8%A7-%D9%81%D9%8A-%D9%85%D8%B5%D8%B1.jpg",
  },
  {
    title: "الترجمة القانونية",
    text: "يقدم المكتب خدمات فائقة التميز فى مجال الترجمة القانونية لكافة انواع العقود واللوائح والوثائق وغيرها.",
    img: "https://plus.unsplash.com/premium_photo-1698084059560-9a53de7b816b?q=80&w=2611&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
  },
];

  export const InfoSections = () => {
  return (
    <div>
      {sections.map((section, index) =>
        index % 2 === 0 ? (
            <InfoRight
            key={index}
            title={section.title}
            text={section.text}
            img={section.img}
          />
        ) : (
         
          <InfoLeft
          key={index}
          title={section.title}
          text={section.text}
          img={section.img}
        />
        )
      )}
    </div>
  );
};


